In [ ]:
from google.colab import drive
drive.mount('/content/gdrive')

Mounted at /content/gdrive

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

import os

%cd /content/gdrive/My Drive/Ai_Lab

df=pd.read_csv('carprices.csv')
df

/content/gdrive/My Drive/Ai_Lab

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5    69000          18000         6
1                  BMW X5    35000          34000         3
2                  BMW X5    57000          26100         5
3                  BMW X5    22500          40000         2
4                  BMW X5    46000          31500         4
5                 Audi A5    59000          29400         5
6                 Audi A5    52000          32000         5
7                 Audi A5    72000          19300         6
8                 Audi A5    91000          12000         8
9   Mercedez Benz C class    67000          22000         6
10  Mercedez Benz C class    83000          20000         7
11  Mercedez Benz C class    79000          21000         7
12  Mercedez Benz C class    59000          33000         5

In [ ]:
#for checking null values

df.isnull().sum()

Car Model        0
Mileage          0
Sell Price($)    0
Age(yrs)         0
dtype: int64

In [ ]:
data_numerical = df[['Mileage','Sell Price($)','Age(yrs)']]
data_numerical

# x=data_numerical
# for i in x:
#   m=data_numerical[i].mean()
#   data_numerical[i].fillna(m, inplace=True)


# data_numerical.isnull().sum()

    Mileage  Sell Price($)  Age(yrs)
0     69000          18000         6
1     35000          34000         3
2     57000          26100         5
3     22500          40000         2
4     46000          31500         4
5     59000          29400         5
6     52000          32000         5
7     72000          19300         6
8     91000          12000         8
9     67000          22000         6
10    83000          20000         7
11    79000          21000         7
12    59000          33000         5

In [ ]:
x= df.drop(['Mileage','Sell Price($)','Age(yrs)'],axis='columns')

data_non_numerical=x

data_non_numerical.groupby('Car Model').count()

Empty DataFrame
Columns: []
Index: [Audi A5, BMW X5, Mercedez Benz C class]

In [ ]:
x=data_numerical
for i in x:
  m=data_numerical[i].mean()
  data_numerical[i].fillna(m, inplace=True)


data_numerical.isnull().sum()

/usr/local/lib/python3.7/dist-packages/pandas/core/series.py:4536: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  downcast=downcast,

Mileage          0
Sell Price($)    0
Age(yrs)         0
dtype: int64

In [ ]:
dumies=pd.get_dummies(data_non_numerical)
dumies

    Car Model_Audi A5  Car Model_BMW X5  Car Model_Mercedez Benz C class
0                   0                 1                                0
1                   0                 1                                0
2                   0                 1                                0
3                   0                 1                                0
4                   0                 1                                0
5                   1                 0                                0
6                   1                 0                                0
7                   1                 0                                0
8                   1                 0                                0
9                   0                 0                                1
10                  0                 0                                1
11                  0                 0                                1
12                  0                 0                                1

In [ ]:
merged=pd.concat([data_numerical,dumies],axis='columns')
merged

    Mileage  Sell Price($)  ...  Car Model_BMW X5  Car Model_Mercedez Benz C class
0     69000          18000  ...                 1                                0
1     35000          34000  ...                 1                                0
2     57000          26100  ...                 1                                0
3     22500          40000  ...                 1                                0
4     46000          31500  ...                 1                                0
5     59000          29400  ...                 0                                0
6     52000          32000  ...                 0                                0
7     72000          19300  ...                 0                                0
8     91000          12000  ...                 0                                0
9     67000          22000  ...                 0                                1
10    83000          20000  ...                 0                                1
11    79000          21000  ...                 0                                1
12    59000          33000  ...                 0                                1

[13 rows x 6 columns]

In [ ]:
from sklearn.model_selection import train_test_split
x=merged.drop(["Car Model_Audi A5","Car Model_BMW X5","Car Model_Mercedez Benz C class","Mileage","Age(yrs)"],axis=1)
y=merged["Sell Price($)"]

In [ ]:
from sklearn.linear_model import LinearRegression
LinReg = LinearRegression()

LinReg.fit(x,y)

LinearRegression()

In [ ]:
LinReg.score(x,y)

1.0